let main = document.querySelector('.main');
let body = document.querySelector('body');

let dataModal = {
  homeVolcanoes: {
    title: "\"Домашние\" вулканы",
    text: "Текст домашних вулканов Далеко-далеко, за словесными горами в стране гласных и согласных живут рыбные тексты. Текстов от всех текста рыбного агентство составитель правилами пунктуация ее! Гор о, рукописи подзаголовок пунктуация океана свой заглавных строчка взгляд. Которой. Журчит наш своего, всеми запятых о строчка буквоград первую ручеек себя грустный курсивных то за пор? Заголовок алфавит она то знаках страна, грамматики раз однажды первую по всей языкового рукописи осталось. Ее, семь назад он которое запятых свое! Гор единственное он пояс? Деревни они свое пустился обеспечивает даже, букв вопроса скатился пунктуация сбить за живет возвращайся большого? Обеспечивает ты рукопись использовало.Речью наш если жаренные путь, не толку которой за единственное заголовок безопасную большой реторический ручеек взобравшись предложения деревни скатился. Путь меня текстами все! Она ему эта текст ipsum. Дал, себя? Подзаголовок страна деревни пояс проектах? Он проектах путь единственное, вопроса силуэт текста? Гор по всей силуэт своего предупредила эта ему щеке вопрос реторический взобравшись ручеек повстречался, переписывается алфавит последний курсивных дороге.Текст домашних вулканов Далеко-далеко, за словесными горами в стране гласных и согласных живут рыбные тексты. Текстов от всех текста рыбного агентство составитель правилами пунктуация ее! Гор о, рукописи подзаголовок пунктуация океана свой заглавных строчка взгляд. Которой. Журчит наш своего, всеми запятых о строчка буквоград первую ручеек себя грустный курсивных то за пор? Заголовок алфавит она то знаках страна, грамматики раз однажды первую по всей языкового рукописи осталось. Ее, семь назад он которое запятых свое! Гор единственное он пояс? Деревни они свое пустился обеспечивает даже, букв вопроса скатился пунктуация сбить за живет возвращайся большого? Обеспечивает ты рукопись использовало.Речью наш если жаренные путь, не толку которой за единственное заголовок безопасную большой реторический ручеек взобравшись предложения деревни скатился. Путь меня текстами все! Она ему эта текст ipsum. Дал, себя? Подзаголовок страна деревни пояс проектах? Он проектах путь единственное, вопроса силуэт текста? Гор по всей силуэт своего предупредила эта ему щеке вопрос реторический взобравшись ручеек повстречался, переписывается алфавит последний курсивных дороге",
    imgUrl: "img/modals/homeVolcanoes.webp",
  },

  monument: {
    title: "Памятник \"Здесь начинается Россия\"",
    text: "Текст про Памятник Далеко-далеко, за словесными горами в стране гласных и согласных живут рыбные тексты. Текстов от всех текста рыбного агентство составитель правилами пунктуация ее! Гор о, рукописи подзаголовок пунктуация океана свой заглавных строчка взгляд. Которой. Журчит наш своего, всеми запятых о строчка буквоград первую ручеек себя грустный курсивных то за пор? Заголовок алфавит она то знаках страна, грамматики раз однажды первую по всей языкового рукописи осталось. Ее, семь назад он которое запятых свое! Гор единственное он пояс? Деревни они свое пустился обеспечивает даже, букв вопроса скатился пунктуация сбить за живет возвращайся большого? Обеспечивает ты рукопись использовало.Речью наш если жаренные путь, не толку которой за единственное заголовок безопасную большой реторический ручеек взобравшись предложения деревни скатился. Путь меня текстами все! Она ему эта текст ipsum. Дал, себя? Подзаголовок страна деревни пояс проектах? Он проектах путь единственное, вопроса силуэт текста? Гор по всей силуэт своего предупредила эта ему щеке вопрос реторический взобравшись ручеек повстречался, переписывается алфавит последний курсивных дороге.Текст домашних вулканов Далеко-далеко, за словесными горами в стране гласных и согласных живут рыбные тексты. Текстов от всех текста рыбного агентство составитель правилами пунктуация ее! Гор о, рукописи подзаголовок пунктуация океана свой заглавных строчка взгляд. Которой. Журчит наш своего, всеми запятых о строчка буквоград первую ручеек себя грустный курсивных то за пор? Заголовок алфавит она то знаках страна, грамматики раз однажды первую по всей языкового рукописи осталось. Ее, семь назад он которое запятых свое! Гор единственное он пояс? Деревни они свое пустился обеспечивает даже, букв вопроса скатился пунктуация сбить за живет возвращайся большого? Обеспечивает ты рукопись использовало.Речью наш если жаренные путь, не толку которой за единственное заголовок безопасную большой реторический ручеек взобравшись предложения деревни скатился. Путь меня текстами все! Она ему эта текст ipsum. Дал, себя? Подзаголовок страна деревни пояс проектах? Он проектах путь единственное, вопроса силуэт текста? Гор по всей силуэт своего предупредила эта ему щеке вопрос реторический взобравшись ручеек повстречался, переписывается алфавит последний курсивных дороге",
    imgUrl: "img/modals/monument.webp",
  },

  paratunka: {
    title: "Посёлок Паратунка",
    text: "Поселок Паратунка находится в долине одноименной реки, в 30 км от аэропорта, извПоселок Паратунка находится в долине одноименной реки, в 30 км от аэропорта, известен лечебными термальными источниками. На его территории, да и вдоль трассы, находится множество баз отдыха с бассейнами под открытым небом - в них можно отдыхать в любое время суток. Для проживающих на базах, как правило, стоимость купания входит в стоимость проживания. В горячей водичке «отмокают» после трудов и походов местные жители и гости Камчатки.Поселок Паратунка находится в долине одноименной реки, в 30 км от аэропорта, известен лечебными термальными источниками. На его территории, да и вдоль трассы, находится множество баз отдыха с бассейнами под открытым небом - в них можно отдыхать в любое время суток. Для проживающих на базах, как правило, стоимость купания входит в стоимость проживания. В горячей водичке «отмокают» после трудов и походов местные жители и гости Камчатки.Поселок Паратунка находится в долине одноименной реки, в 30 км от аэропорта, известен лечебными термальными источниками. На его территории, да и вдоль трассы, находится множество баз отдыха с бассейнами под открытым небом - в них можно отдыхать в любое время суток. Для проживающих на базах, как правило, стоимость купания входит в стоимость проживания. В горячей водичке «отмокают» после трудов и походов местные жители и гости Камчатки.Поселок Паратунка находится в долине одноименной реки, в 30 км от аэропорта, известен лечебными термальными источниками. На его территории, да и вдоль трассы, находится множество баз отдыха с бассейнами под открытым небом - в них можно отдыхать в любое время суток. Для проживающих на базах, как правило, стоимость купания входит в стоимость проживания. В горячей водичке «отмокают» после трудов и походов местные жители и гости Камчатки.Поселок Паратунка находится в долине одноименной реки, в 30 км от аэропорта, известен лечебными термальными источниками. На его территории, да и вдоль трассы, находится множество баз отдыха с бассейнами под открытым небом - в них можно отдыхать в любое время суток. Для проживающих на базах, как правило, стоимость купания входит в стоимость проживания. В горячей водичке «отмокают» после трудов и походов местные жители и гости Камчатки.Поселок Паратунка находится в долине одноименной реки, в 30 км от аэропорта, извПоселок Паратунка находится в долине одноименной реки, в 30 км от аэропорта, известен лечебными термал",
    imgUrl: "img/modals/paratunka.webp",
  },

  viluchinskyVolcano: {
    title: "Вулкан \"Вилючинский\"",
    text: "Текст про Вулкан \"Вилючинский\" Текст домашних вулканов Далеко-далеко, за словесными горами в стране гласных и согласных живут рыбные тексты. Текстов от всех текста рыбного агентство составитель правилами пунктуация ее! Гор о, рукописи подзаголовок пунктуация океана свой заглавных строчка взгляд. Которой. Журчит наш своего, всеми запятых о строчка буквоград первую ручеек себя грустный курсивных то за пор? Заголовок алфавит она то знаках страна, грамматики раз однажды первую по всей языкового рукописи осталось. Ее, семь назад он которое запятых свое! Гор единственное он пояс? Деревни они свое пустился обеспечивает даже, букв вопроса скатился пунктуация сбить за живет возвращайся большого? Обеспечивает ты рукопись использовало.Речью наш если жаренные путь, не толку которой за единственное заголовок безопасную большой реторический ручеек взобравшись предложения деревни скатился. Путь меня текстами все! Она ему эта текст ipsum. Дал, себя? Подзаголовок страна деревни пояс проектах? Он проектах путь единственное, вопроса силуэт текста? Гор по всей силуэт своего предупредила эта ему щеке вопрос реторический взобравшись ручеек повстречался, переписывается алфавит последний курсивных дороге.",
    imgUrl: "img/modals/viluchinskyVolcano.webp",
  },

  viluchinskyWaterfall: {
    title: "Вилючинский водопад",
    text: "Текст про Вилючинский водопад Текст домашних вулканов Далеко-далеко, за словесными горами в стране гласных и согласных живут рыбные тексты. Текстов от всех текста рыбного агентство составитель правилами пунктуация ее! Гор о, рукописи подзаголовок пунктуация океана свой заглавных строчка взгляд. Которой. Журчит наш своего, всеми запятых о строчка буквоград первую ручеек себя грустный курсивных то за пор? Заголовок алфавит она то знаках страна, грамматики раз однажды первую по всей языкового рукописи осталось. Ее, семь назад он которое запятых свое! Гор единственное он пояс? Деревни они свое пустился обеспечивает даже, букв вопроса скатился пунктуация сбить за живет возвращайся большого? Обеспечивает ты рукопись использовало.Речью наш если жаренные путь, не толку которой за единственное заголовок безопасную большой реторический ручеек взобравшись предложения деревни скатился. Путь меня текстами все! Она ему эта текст ipsum. Дал, себя? Подзаголовок страна деревни пояс проектах? Он проектах путь единственное, вопроса силуэт текста? Гор по всей силуэт своего предупредила эта ему щеке вопрос реторический взобравшись ручеек повстречался, переписывается алфавит последний курсивных дороге.",
    imgUrl: "img/modals/viluchinskyWaterfall.webp",
  },

  paratunkaSprings: {
    title: "Верхне-паратунские источники",
    text: "Текст про Верхне-паратунские источники Текст домашних вулканов Далеко-далеко, за словесными горами в стране гласных и согласных живут рыбные тексты. Текстов от всех текста рыбного агентство составитель правилами пунктуация ее! Гор о, рукописи подзаголовок пунктуация океана свой заглавных строчка взгляд. Которой. Журчит наш своего, всеми запятых о строчка буквоград первую ручеек себя грустный курсивных то за пор? Заголовок алфавит она то знаках страна, грамматики раз однажды первую по всей языкового рукописи осталось. Ее, семь назад он которое запятых свое! Гор единственное он пояс? Деревни они свое пустился обеспечивает даже, букв вопроса скатился пунктуация сбить за живет возвращайся большого? Обеспечивает ты рукопись использовало.Речью наш если жаренные путь, не толку которой за единственное заголовок безопасную большой реторический ручеек взобравшись предложения деревни скатился. Путь меня текстами все! Она ему эта текст ipsum. Дал, себя? Подзаголовок страна деревни пояс проектах? Он проектах путь единственное, вопроса силуэт текста? Гор по всей силуэт своего предупредила эта ему щеке вопрос реторический взобравшись ручеек повстречался, переписывается алфавит последний курсивных дороге.",
    imgUrl: "img/modals/paratunkaSprings.webp",
  },

  vachkazhetsVolcano: {
    title: "Вачкажец",
    text: "Текст про Вачкажец",
    imgUrl: "img/modals/vachkazhetsVolcano.webp",
  },

  vachkazhetsWaterfalls: {
    title: "Водопады Вачкажца",
    text: "Текст про Водопады Вачкажца",
    imgUrl: "img/modals/vachkazhetsWaterfalls.webp",
  },

  mountainLake: {
    title: "Горное озеро",
    text: "Текст про Горное озеро",
    imgUrl: "img/modals/mountainLake.webp",
  },

  avachinskyVolcano: {
    title: "Подножие Авачинского вулкана",
    text: "Текст про Подножие Авачинского вулкана",
    imgUrl: "img/modals/avachinskyVolcano.webp",
  },

  camelMountain: {
    title: "Гора Верблюд",
    text: "Текст про Гора Верблюд",
    imgUrl: "img/modals/camelMountain.webp",
  },

  avachinskayaBay: {
    title: "Авачинская бухта",
    text: "Текст про Авачинская бухта",
    imgUrl: "img/modals/avachinskayaBay.webp",
  },

  rocksThreeBrothers: {
    title: "Скалы \"Три брата\"",
    text: "Текст про Скалы \"Три брата\"",
    imgUrl: "img/modals/rocksThreeBrothers.webp",
  },

  islandOfOldies: {
    title: "Остров Старичков",
    text: "Текст про Остров Старичков",
    imgUrl: "img/modals/islandOfOldies.webp",
  },

  khalaktyrBeach: {
    title: "Халактырский пляж",
    text: "Текст про Халактырский пляж",
    imgUrl: "img/modals/khalaktyrBeach.webp",
  },

  mishennayaHill: {
    title: "Мишенная сопка",
    text: "Текст про Мишенная сопка",
    imgUrl: "img/modals/mishennaya.webp",
  },

  fishMarket: {
    title: "Рыбный рынок",
    text: "Текст про Рыбный рынок",
    imgUrl: "img/modals/fishMarket.webp",
  },

  valleyOfGeysers: {
    title: "Долина гейзеров",
    text: "Текст про Долина гейзеров",
    imgUrl: "img/modals/valleyOfGeysers.webp",
  },

  calderaUzon: {
    title: "Кальдера вулкана Узон",
    text: "Текст про Кальдера вулкана Узон",
    imgUrl: "img/modals/calderaUzon.webp",
  },

  nalychevskayaValley: {
    title: "Налычевская долина",
    text: "Текст про Налычевская долина",
    imgUrl: "img/modals/nalychevskayaValley.webp",
  },
};

function createModal(data, place) {
  let modals = document.createElement('div');
  modals.classList = "modals";
  place.append(modals);

  for (let key in data) {
    modals.insertAdjacentHTML('beforeend', `
    <div class="modal visually-hidden" data-modal="${key}">
      <div class="modal__overlay"></div>
      <div class="modal__box">
        <span class="modal__close">
          <span></span>
          <span></span>
        </span>
        <div class="modal__header" style="background-image: url(${data[key]['imgUrl']});"></div>
        <h4 class="modal__title">${data[key]['title']}</h4>
        <div class="modal__content">
          <p class="modal__text">${data[key]['text']}</p>
        </div>
        <div class="modal__footer">
          <div class="modal__footer-close">
            <span class="modal__footer-button">Вернуться в маршруту</span>
          </div>
        </div>
      </div>
    </div>
    `);
  }
}
createModal(dataModal, body);

let slides = document.querySelectorAll('.swiper-slide');

/* Модалки на visuallyhidden */
function showModal(elements) {
  for (let element of elements) {
    /* по клику на элементе */
    element.addEventListener('click', function () {
      /* 1) блокируем прокрутку */
      body.style.overflow = "hidden";
      /* 2) забираем атрибут с кликнутого элемента */
      let clickedElement = element.getAttribute('data-target');
      /* 3) ищем модалку с тем же значением атрибута */
      let matchedModal = document.querySelector(`[data-modal="${clickedElement}"]`);
      /* 4) включаем модалку */
      matchedModal.classList.remove('visually-hidden');
      //////////////////////////////////////////
      /* 5) Находим закрывающие элементы внутри активной модалки */
      let closeModalElements = matchedModal.querySelectorAll('.modal__overlay, .modal__close, .modal__footer-close, .modal__footer-button');
      /* 6) Каждая из них будет её закрывать модалку и возвращать прокрутку */
      closeModalElements.forEach((el) => {
        el.addEventListener('click', function () {
          matchedModal.classList.add('visually-hidden');
          body.style.overflow = "visible";
        });
      });
    });
  }
}
showModal(slides);
